Args <- commandArgs()
set.seed(1234)
suppressWarnings(library(kernlab))
suppressWarnings(library(e1071))
data <- read.csv("./machine-learning/gaoxy/cleaned.csv", head = TRUE)
test <- data.frame(身高=as.numeric(Args[6]),
                     体重=as.numeric(Args[7]),
                     性别=as.numeric(Args[9]),
                     年龄=as.numeric(Args[10]),
                     职业=as.numeric(Args[14]),
                     现在吸烟情况=as.numeric(Args[17]),
                     饮酒情况=as.numeric(Args[19]),
                     高血压家族史=as.numeric(Args[25]),
                     冠心病家族史=as.numeric(Args[27]),
                     高血压病史=as.numeric(Args[30]),
                     rs2336384=as.numeric(Args[126]),
                     rs2295281=as.numeric(Args[127]),
                     rs3827750=as.numeric(Args[132]),
                     rs2638360=as.numeric(Args[67]),
                     rs6801836=as.numeric(Args[156]),
                     rs5182=as.numeric(Args[93]),
                     rs6825911=as.numeric(Args[158]),
                     rs1799998=as.numeric(Args[141]),
                     rs4409766=as.numeric(Args[85]),
                     rs12828016=as.numeric(Args[76]),
                     rs2051852=as.numeric(Args[77]),
                     rs2106809=as.numeric(Args[98]))

#test=data.frame(身高=158,体重=62,腰围=86,性别=2,年龄=66,您在北京居住时间是否超过15年=0,婚姻状况=1,职业=8,文化程度=0,医药费报销方式=3,
#现在吸烟情况=3,现在平均每天吸烟量=0,饮酒情况=1,白酒=0,啤酒=0,红酒=0,饮酒量=0,平均饮酒频率=0,高血压家族史=3,糖尿病家族史=3,冠心病家族史=3,
#急性心肌梗死家族史=3,脑卒中家族史=2,高血压病史=1,患高血压年限=15,有几种高血压并发症=1,最近两周服药情况=1,血脂异常情况=1,脂肪肝情况=2,
#患心肌梗死情况=2,患脑卒中情况=2,是否经常体育锻炼=0,每次运动持续时间=0,每周20分钟以上运动次数=0,心电图Sv1=0.7,心电图Rv5=1.7,谷丙转氨酶=21,
#尿素=5.3,血糖=5.64,甘油三酯=2.8,高密度脂蛋白胆固醇=0.92,糖化血红蛋白=0,c反应蛋白=0.95,肌酸激酶=108,乳酸脱氢酶=208,钠=140.2,镁=0.96,
#谷草转氨酶=26,肌酐=56,总胆固醇=4.88,低密度脂蛋白胆固醇=2.74,同型半胱氨酸=11.8,尿酸=253.6,
#rs11064524=1,rs3772616=2,rs275649=0,rs17030613=3,rs3736556=2,rs2638360=1,rs4980974=1,rs5194=2,rs4757391=1,rs5193=3,rs11608756=0,rs2131127=3,
#rs7305099=3,rs880054=1,rs12828016=3,rs2051852=3,rs4980973=1,rs820430=1,rs10849558=3,rs388915=2,rs5186=0,rs11067763=2,rs10774461=1,rs4409766=1,
#rs1492100=2,rs11611231=3,rs2074192=3,rs13143871=2,rs35444=1,rs1191548=1,rs4838825=1,rs5182=2,rs11066280=1,rs1887320=3,rs956868=3,rs17249754=1,
#rs2106809=3,rs1991391=3,rs16849255=3,rs1902859=3,rs1800766=1,rs7972490=3,rs9426748=2,rs7079=3,rs5370=2,rs6632677=3,rs1630736=2,rs9810888=2,
#rs1173766=2,rs11571078=3,rs3820189=3,rs3753579=1,rs1042717=3,rs17037564=1,rs1042719=3,rs3802228=2,rs10088365=3,rs11240688=2,rs6693954=1,rs1042713=2,
#rs3889728=2,rs11568023=3,rs2774028=2,rs11122575=1,rs2336384=1,rs2295281=2,rs7539020=1,rs1464816=2,rs2236058=3,rs212515=2,rs3827750=3,rs2076283=3,
#rs1042714=2,rs4461142=1,rs2236847=2,rs2236057=3,rs115071=3,rs212544=1,rs11590928=3,rs1799998=2,rs2076280=2,rs2282715=2,rs3766741=2,rs2493132=2,
#rs2478523=3,rs6433=1,rs2478545=2,rs699=3,rs4344=3,rs880315=2,rs5050=2,rs4762=2,rs3789671=2,rs4994=2,rs6801836=1,rs10774457=3,rs6825911=2,rs11658531=2)

svmfit <- ksvm(是否为高血压 ~ 身高+体重+性别+年龄+职业+现在吸烟情况+饮酒情况+高血压家族史+冠心病家族史+高血压病史+
                       rs2336384+rs2295281+rs3827750+rs2638360+rs6801836+rs5182+rs6825911+rs1799998+rs4409766+rs12828016+rs2051852+rs2106809,
                     data = data,type="C-svc",kernel="laplacedot",dpar=list(sigma=0.001),C=10,cross=10,prob.model=TRUE)

pred <- predict(svmfit,test,type="probabilities")
output<-round(pred[,2],3)
output<-paste(output*100,sep="")
cat(output)

